{
    "version": "https://jsonfeed.org/version/1",
    "title": "An Excursion Through the Mind",
    "description": "",
    "home_page_url": "https://shanteshpatil.github.io/shanteshpatil",
    "feed_url": "https://shanteshpatil.github.io/shanteshpatil/feed.json",
    "user_comment": "",
    "author": {
        "name": "Shantesh Patil"
    },
    "items": [
        {
            "id": "https://shanteshpatil.github.io/shanteshpatil/watch-with-me.html",
            "url": "https://shanteshpatil.github.io/shanteshpatil/watch-with-me.html",
            "title": "Watch With Me",
            "summary": "It's an exceptionally bright November morning for Prague. While most of the people on my timeline are posting about the upcoming cricket finals I am starting to watch Jawaan Extended Edition. Why? I gave up on watching sports of almost any kind years ago. I&hellip;",
            "content_html": "<p>It's an exceptionally bright November morning for Prague. While most of the people on my timeline are posting about the upcoming cricket finals I am starting to watch Jawaan Extended Edition. Why? I gave up on watching sports of almost any kind years ago. I still have a passing interest in tennis, but cricket was the first to slip off my radar. Also, I am not particularly a Shahrukh Khan fan. We are watching the movie because it was just there, taunting us with its presence on the home screen of Netflix.</p>\n<p>In between scenes I scroll through social media. Seeing all the posts about the match it's hard not to get caught up in the fervor. But the feeling is momentary. I ask my wife if she watched cricket in her younger days. And we realize that we both watched with much enthusiasm back then. What changed over the years?</p>\n<p>Cricket can be an exceptionally long game punctuated by a lot of filler in between the exciting moments. Over the years I just got less patient with everything. The other factor that we realized was common to both of us though was the people we watched it with. For both of us it was our grandfathers.</p>\n<p>While I cannot comment on her individual experience, my memories of it are mostly clear. After retirement was the phase of his life around which I was born. And other than the copious amount of time spent reading the newspaper, the rest was spent watching various kinds of sports. Primarily cricket, tennis, football and Formula 1 racing.</p>\n<p>The way he watched was with a kind of detached calm. Focused on every minute of the match but without a single sound no matter what was happening in the game. I watched while sitting beside him with a similarly tepid display of emotions. But I was always in awe of him. He kept sharing with me facts from the yesteryear of the game. When they didn’t even have televisions in the house.</p>\n<p>That for me was why I watched more than anything else. In the absence of the internet and social media the matches were certainly a major talking point. But it really was a bonding experience. Those days were some of the most memorable moments I have had with him. After he was gone the experience of watching sports was never the same for me.</p>",
            "image": "https://shanteshpatil.github.io/shanteshpatil/media/posts/1/_502ac09c-c5fa-4506-adf5-0dc97c29f61a.jpeg",
            "author": {
                "name": "Shantesh Patil"
            },
            "tags": [
            ],
            "date_published": "2023-11-28T13:47:48+01:00",
            "date_modified": "2024-11-08T15:40:35+01:00"
        }
    ]
}
